## Data Preparation Basics

In [2]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

### Accessing data with Label index and Integer index

In [3]:
# Create a simple series without index, By Default it uses integer index 0 to n

series_no_index = Series(np.arange(1,10,2))
series_no_index

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [3]:
# Create a simple series with index

rowindex=["row "+str(x) for x in range(10)]

series_obj = Series(np.arange(0,20,2), index=rowindex)
series_obj

row 0     0
row 1     2
row 2     4
row 3     6
row 4     8
row 5    10
row 6    12
row 7    14
row 8    16
row 9    18
dtype: int64

In [25]:
#access data with label and integer index
print(f'row 5 label value is : {series_obj["row 5"]}')
print()
## integer index 
print(f'index 4  value is : {series_obj[4]}')
print()
## integer index - fetch multi values
print(f'index 4,5,6 value is :\n{series_obj[[4,5,6]]}')
print()

row 5 label value is : 10

index 4  value is : 8

index 4,5,6 value is :
row 4     8
row 5    10
row 6    12
dtype: int64

In [34]:
## create data frame example 

np.random.seed(25)

rowindex=["row "+str(x) for x in range(1,7,1)]
colindex=["col "+str(x) for x in range(1,7,1)]

df_obj = DataFrame(np.random.rand(36).reshape(6,6), index=rowindex, columns=colindex)
df_obj

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [36]:
## access data 

## access row and col 


df_obj.loc[['row 2', 'row 5'], ['col 2','col 5']]

          col 2     col 5
row 2  0.437611  0.402366
row 5  0.559053  0.421004

In [41]:
## access row and col with range 

df_obj.iloc[1:4,1:4]

          col 2     col 3     col 4
row 2  0.437611  0.556229  0.367080
row 3  0.585445  0.161985  0.520719
row 4  0.836375  0.481343  0.516502

### Data Slicing

In [42]:
series_obj[1:3] ## on series

row 1    2
row 2    4
dtype: int64

In [43]:
series_obj[1:3] ## on data frame 
df_obj.iloc[1:4,1:4]

          col 2     col 3     col 4
row 2  0.437611  0.556229  0.367080
row 3  0.585445  0.161985  0.520719
row 4  0.836375  0.481343  0.516502

### Comparing Values  and Filters

In [46]:
df_obj<.2

       col 1  col 2  col 3  col 4  col 5  col 6
row 1  False  False  False   True  False   True
row 2  False  False  False  False  False   True
row 3  False  False   True  False  False  False
row 4  False  False  False  False  False  False
row 5  False  False   True  False  False  False
row 6  False  False  False  False  False  False

In [51]:
series_obj[series_obj>10] ## only values > 10

row 6    12
row 7    14
row 8    16
row 9    18
dtype: int64

In [55]:
## setting values with scalars 
print(series_obj)
series_obj[series_obj>10]=10
print(series_obj)

row 0     0
row 1     2
row 2     4
row 3     6
row 4     8
row 5    10
row 6    12
row 7    14
row 8    16
row 9    18
dtype: int64
row 0     0
row 1     2
row 2     4
row 3     6
row 4     8
row 5    10
row 6    10
row 7    10
row 8    10
row 9    10
dtype: int64

## missing values

In [6]:


#adding few missing values to series_obj
missing = np.nan
series_obj.loc['row 10'] = missing
series_obj.loc['row 11'] = 12.00
series_obj.loc['row 12'] = missing

series_obj

row 0      0.0
row 1      2.0
row 2      4.0
row 3      6.0
row 4      8.0
row 5     10.0
row 6     12.0
row 7     14.0
row 8     16.0
row 9     18.0
row 10     NaN
row 11    12.0
row 12     NaN
dtype: float64

In [8]:
#check how many elements are null
series_obj.isnull()

row 0     False
row 1     False
row 2     False
row 3     False
row 4     False
row 5     False
row 6     False
row 7     False
row 8     False
row 9     False
row 10     True
row 11    False
row 12     True
dtype: bool

### Filling Missing Values

In [9]:
## create data frame example

rowindex=["row "+str(x) for x in range(1,7,1)]
colindex=["col "+str(x) for x in range(1,7,1)]

df_obj = DataFrame(np.random.rand(36).reshape(6,6), index=rowindex, columns=colindex)
df_obj

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.398615  0.957505  0.108189  0.148248  0.262128  0.946035
row 2  0.784067  0.918139  0.369697  0.916951  0.195749  0.191043
row 3  0.204398  0.852855  0.905445  0.144089  0.883152  0.203316
row 4  0.865976  0.690759  0.297003  0.435136  0.283879  0.072647
row 5  0.367407  0.042702  0.800873  0.798374  0.080060  0.455399
row 6  0.496345  0.519673  0.158813  0.797526  0.569424  0.100498

In [23]:
#set some values to missing

df_obj.iloc[3:5,0:2] = missing
df_obj.iloc[0:2,0:2] = 0.00

df_obj

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.000000  0.000000  0.108189  0.148248  0.262128  0.946035
row 2  0.000000  0.000000  0.369697  0.916951  0.195749  0.191043
row 3  0.204398  0.852855  0.905445  0.144089  0.883152  0.203316
row 4       NaN       NaN  0.297003  0.435136  0.283879  0.072647
row 5       NaN       NaN  0.800873  0.798374  0.080060  0.455399
row 6  0.496345  0.519673  0.158813  0.797526  0.569424  0.100498

In [21]:
#fill missing values with 0 


df_obj= df_obj.fillna(0)
df_obj

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.000000  0.000000  0.108189  0.148248  0.262128  0.946035
row 2  0.000000  0.000000  0.369697  0.916951  0.195749  0.191043
row 3  0.204398  0.852855  0.905445  0.144089  0.883152  0.203316
row 4  0.000000  0.000000  0.297003  0.435136  0.283879  0.072647
row 5  0.000000  0.000000  0.800873  0.798374  0.080060  0.455399
row 6  0.496345  0.519673  0.158813  0.797526  0.569424  0.100498

## counting missing values

In [29]:
# Count null values by columns
df_obj.isnull().sum()

col 1    2
col 2    2
col 3    0
col 4    0
col 5    0
col 6    0
dtype: int64

## Filter missing values

In [26]:
df_obj.dropna() ## drop all rows with null values

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.000000  0.000000  0.108189  0.148248  0.262128  0.946035
row 2  0.000000  0.000000  0.369697  0.916951  0.195749  0.191043
row 3  0.204398  0.852855  0.905445  0.144089  0.883152  0.203316
row 6  0.496345  0.519673  0.158813  0.797526  0.569424  0.100498

In [27]:
df_obj.dropna(axis=1) ## drop all columns with null values

          col 3     col 4     col 5     col 6
row 1  0.108189  0.148248  0.262128  0.946035
row 2  0.369697  0.916951  0.195749  0.191043
row 3  0.905445  0.144089  0.883152  0.203316
row 4  0.297003  0.435136  0.283879  0.072647
row 5  0.800873  0.798374  0.080060  0.455399
row 6  0.158813  0.797526  0.569424  0.100498

## Removing Duplicates

In [33]:
df_obj = DataFrame({'c1':[1,1,1,2,3,2],
                   'c2':['a','a','a','b','c','d'],
                   'c3':[1,1,1,2,3,2],})

df_obj

   c1 c2  c3
0   1  a   1
1   1  a   1
2   1  a   1
3   2  b   2
4   3  c   3
5   2  d   2

In [34]:
df_obj.duplicated()   ## check every row is duplicate of any other row

0    False
1     True
2     True
3    False
4    False
5    False
dtype: bool

In [35]:
df_obj.drop_duplicates() # Drop Duplicate rows

   c1 c2  c3
0   1  a   1
3   2  b   2
4   3  c   3
5   2  d   2

In [36]:
# drop values by checking column values 

df_obj = DataFrame({'c1':[1,1,1,2,3,2],
                   'c2':['a','a','a','b','c','d'],
                   'c3':[1,1,1,2,3,2],})

df_obj

   c1 c2  c3
0   1  a   1
1   1  a   1
2   1  a   1
3   2  b   2
4   3  c   3
5   2  d   2

In [39]:
df_obj.drop_duplicates(['c1','c2']) # Check only 2 columns instead of checking all 3

   c1 c2  c3
0   1  a   1
3   2  b   2
4   3  c   3
5   2  d   2